### Conexión Python - PostgresSQL
El primer paso es instalar el adaptador, para ello utilizaremos:

In [75]:
import psycopg2

Después debemos crear la conexión con la base de datos de PostgresSQL

In [76]:
conn = psycopg2.connect (host = "localhost", 
                        database = "Sakila",
                        user = "postgres", 
                        password = "9366")

Ahora ya podemos generar consultas. Estas consultas deben tener la siguiente estructura:

```python
sql_query = '''Consulta de SQL'''
cursor = conn.cursor() # Creamos una variable con la que iniciamos el cursor
cursor.execute(sql_query) # Ejecutamos la query
rows = cursor.fetchall() # Creamos una variable con el restultado de la query en forma de lista de tuplas
tabla = pd.DataFrame(rows)# Genereamos un DataFrame a partir de la variable anterior
colnames = [desc[0] for desc in cursor.description] # Recuperamos los nombres de las columnas de la BBDD. cursor.description devuelve una tupla de tuplas con la misma longitud que columnas tenemos en nuestro resultado de la query. Además, el primer término de cada tupla es el nombre de la columna, por ello vamos a iterar por las tuplas y a tomar el término de la posición 0 para poder crear nuestra lista con los nombres de las columnas.
tabla = tabla.set_axis(colnames, axis = 1)# Renombramos las columnas del DF creado para que coincidan con las de la BBDD
display(tabla)
```

In [77]:
import pandas as pd

## 2. Ejercicios
2.1. Encuentra el título de las películas en la tabla film que no sean ni "NC-17" ni "G" en cuanto a su clasificación

In [78]:
sql_query = '''
SELECT "title"                   AS "Título",
        "rating"                 AS "Clasificación"
FROM "film"
WHERE "rating" <> 'NC-17' 

'''
cursor = conn.cursor() 
cursor.execute(sql_query) 
rows = cursor.fetchall() 
tabla = pd.DataFrame(rows)
colnames = [desc[0] for desc in cursor.description] 
tabla = tabla.set_axis(colnames, axis = 1)
display(tabla)

                Título Clasificación
0     ACADEMY DINOSAUR            PG
1       ACE GOLDFINGER             G
2     AFFAIR PREJUDICE             G
3          AFRICAN EGG             G
4         AGENT TRUMAN            PG
..                 ...           ...
785     WRONG BEHAVIOR         PG-13
786      WYOMING STORM         PG-13
787        YENTL IDAHO             R
788     YOUNG LANGUAGE             G
789  ZOOLANDER FICTION             R

[790 rows x 2 columns]

2.2. Número de películas por categoría estrenadas en 2006

In [79]:
sql_query = '''
SELECT COUNT("title")                   AS "Número de películas",
        "rating"                 AS "Clasificación"
FROM "film"
WHERE "release_year" = 2006
GROUP BY "rating" 

'''
cursor = conn.cursor() 
cursor.execute(sql_query) 
rows = cursor.fetchall() 
tabla = pd.DataFrame(rows)
colnames = [desc[0] for desc in cursor.description] 
tabla = tabla.set_axis(colnames, axis = 1)
display(tabla)

   Número de películas Clasificación
0                  194            PG
1                  223         PG-13
2                  195             R
3                  178             G
4                  210         NC-17

2.3. Averigua el número de alquileres registrados por mes.

In [80]:
sql_query = '''
SELECT EXTRACT(MONTH FROM "rental_date")   AS "Mes de alquiler",
       COUNT("rental_id")
FROM "rental"
GROUP BY "Mes de alquiler" 
ORDER BY "Mes de alquiler"

'''
cursor = conn.cursor() 
cursor.execute(sql_query) 
rows = cursor.fetchall() 
tabla = pd.DataFrame(rows)
colnames = [desc[0] for desc in cursor.description] 
tabla = tabla.set_axis(colnames, axis = 1)
display(tabla)

  Mes de alquiler  count
0               2    182
1               5   1156
2               6   2311
3               7   6709
4               8   5686

2.4. Obtener todas las películas y mostrar los actores que han actuado en ellas, incluso si algunas películas no tienen actores asociados.

In [81]:
sql_query = '''
SELECT "f"."title"  AS "Películas",
       CONCAT("a"."first_name", ' ',"a"."last_name")  AS "Actores"
       
FROM "film" AS "f",
      "actor" AS "a"


'''
cursor = conn.cursor() 
cursor.execute(sql_query) 
rows = cursor.fetchall() 
tabla = pd.DataFrame(rows)
colnames = [desc[0] for desc in cursor.description] 
tabla = tabla.set_axis(colnames, axis = 1)
display(tabla)

               Películas              Actores
0       ACADEMY DINOSAUR     PENELOPE GUINESS
1       ACADEMY DINOSAUR        NICK WAHLBERG
2       ACADEMY DINOSAUR             ED CHASE
3       ACADEMY DINOSAUR       JENNIFER DAVIS
4       ACADEMY DINOSAUR  JOHNNY LOLLOBRIGIDA
...                  ...                  ...
199995         ZORRO ARK          BELA WALKEN
199996         ZORRO ARK           REESE WEST
199997         ZORRO ARK          MARY KEITEL
199998         ZORRO ARK        JULIA FAWCETT
199999         ZORRO ARK         THORA TEMPLE

[200000 rows x 2 columns]

2.5. Obtén los 5 clientes españoles que más dinero se hayan gastado con nosotros.

2.6. Encuentra el nombre y apellido de los actores que no han actuado en ninguna película de la categoría "Music". 

2.7. Encuentra el título de todas las películas que son de la misma categoría que "Animation".

2.8. Encuentra los nombres de los actores que han actuado en al menos una película que pertenece a la categoría "Sci-Fi." Ordena los resultados alfabéticamente por apellido.